import numpy as np

lists = ['Вiльнюс', 'Вiтебськ', 'Вiтебськ', 'Вороніж', 'Вороніж', 'Волгоград', 'Вiтебськ',
         'Вiльнюс', 'Калiнiнград', 'Калiнiнград', 'Каунас', 'Київ', 'Київ', 'Житомир', 'Житомир',
         'Кишинiв', 'Кишинів', 'Санкт-Петербург', 'Санкт-Петербург', 'Санкт-Петербург', 'Москва',
         'Москва', 'Москва', 'Москва', 'Москва', 'Мурманськ', 'Мурманськ', 'Орел', 'Орел', 'Орел',
         'Одеса', 'Рига', 'Таллін', 'Харків', 'Харків', 'Ярославль', 'Ярославль', 'Уфа', 'Уфа']

lists2 = ['Брест', 'Брест', 'Вiльнюс', 'Вiтебськ', 'Волгоград', 'Вiтебськ', 'Нижній Новгород',
          'Даугавпілс', 'Брест', 'Вiльнюс', 'Вiльнюс', 'Вiльнюс', 'Житомир', 'Донецьк', 'Волгоград',
          'Київ', 'Донецьк', 'Вiтебськ', 'Калiнiнград', 'Рига', 'Казань', 'Нижній Новгород', 'Мiнськ',
          'Донецьк', 'Санкт-Петербург', 'Санкт-Петербург', 'Мiнськ', 'Вiтебськ', 'Донецьк', 'Москва',
          'Київ', 'Каунас', 'Рига', 'Київ', 'Сімферополь', 'Вороніж', 'Мiнськ', 'Казань', 'Самара']


a = np.array(lists)
a2 = np.array(lists2)


print(a)
print(a2)

print('кількість елементів')
print(len(lists))
print(len(lists2))

print(a.size)
print(a2.size)

print('не повторюючі елементи')
print(set(a))
print(set(a2))

print(np.unique(a))
print(np.unique(a2))

print('кількість не повторюючих елементів')
print(len(set(a)))
print(len(set(a2)))

print(np.unique(a).size)
print(np.unique(a2).size)


print('елементи з обох списків')
alls = []
alls.extend(lists)
alls.extend(lists2)
print(alls)
print(len(alls))
print(set(alls))
print(len(set(alls)))

print('елементи з обох списків numpy')
allnp = np.append(a, a2)
print(allnp)
print(allnp.size)
print(np.unique(allnp))
print(np.unique(allnp).size)
